# GetAssociateFamilyParameterId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPFamilyConnectorInfo..::..GetAssociateFamilyParameterId Method
MEPFamilyConnectorInfo Class See Also
---
Gets the associate family parameter id of the specified connector parameter id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ElementId GetAssociateFamilyParameterId(
	ElementId connectorParameterId
)
```

Visual Basic
---
```text
Public Function GetAssociateFamilyParameterId ( _
	connectorParameterId As ElementId _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetAssociateFamilyParameterId(
	ElementId^ connectorParameterId
)
```

# ### Parameters
connectorParameterId
    Type: Autodesk.Revit.DB..::..ElementId connectorParameterId is defined in the family connector element.
# ### Return Value
Returns valid ElementId if the connectorParameterId associates to one family parameter; otherwise returns invalid ElementId.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MEPFamilyConnectorInfo Class
Autodesk.Revit.DB Namespace